Padrões de Projeto/exercicio 03 - Adapter/pattern/Adapter/__history/UAdaptee.pas.~2~

unit UAdaptee;

interface

uses
  UWebServiceCorreios, System.Classes;

type
  TWebServiceCorreios = class
    private
    FParametros: ConsultaCEP;
    FResposta: EnderecoERP;

    procedure BeforeExecute(const aMethodName: String; aSOAPRequest: TStream);
    public
      destructor Destroy; override;
      procedure DefinirParametrosCOnsulta(const aCep: String);
      procedure ConsultarCEP;
      function ObterResposta(const aInformacao: string):String;
  end;

implementation

uses
  Soap.SOAPHTTPClient, System.SysUtils;

{ TWebServiceCorreios }

procedure TWebServiceCorreios.BeforeExecute(const aMethodName: String;
  aSOAPRequest: TStream);
var
  xRequest: TStringList;
begin
 try
   xRequest.Text :=
      '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://cliente.bean.master.sigep.bsb.correios.com.br/">' +
      '  <soapenv:Header/>' +
      '    <soapenv:Body>' +
      '      <cli:consultaCEP>' +
      '        <cep>' + FParametros.cep  + '</cep>' +
      '      </cli:consultaCEP>' +
      '    </soapenv:Body>' +
      '</soapenv:Envelope>';

    aSOAPRequest.Position := 0;
    aSOAPRequest.Size := Length(xRequest.Text);
    xRequest.SaveToStream(aSOAPRequest)
 finally
    FreeAndNil(xRequest);
 end;
end;

procedure TWebServiceCorreios.ConsultarCEP;
begin

end;

procedure TWebServiceCorreios.DefinirParametrosCOnsulta(const aCep: String);
begin

end;

destructor TWebServiceCorreios.Destroy;
begin

  inherited;
end;

function TWebServiceCorreios.ObterResposta(const aInformacao: string): String;
begin

end;

end.
